# -*- coding: utf-8 -*-

# Вас взяли на работу в молодой стартап. Идея стартапа - предоставлять сервис расчета результатов игр.
# Начать решили с боулинга, упрощенной версии.
#
# Правила такие.
#
# Всего 10 кеглей. Игра состоит из 10 фреймов. В одном фрейме до 2х бросков, цель - сбить все кегли.
# Результаты фрейма записываются символами:
#   «Х» – «strike», все 10 кеглей сбиты первым броском
#   «<число>/», например «4/» - «spare», в первый бросок сбиты 4 кегли, во второй – остальные
#   «<число><число>», например, «34» – в первый бросок сбито 3, во второй – 4 кегли.
#   вместо <число> может стоять прочерк «-», например «-4» - ни одной кегли не было сбито за первый бросок
# Результат игры – строка с записью результатов фреймов. Символов-разделителей между фреймами нет.
# Например, для игры из 4 фреймов запись результатов может выглядеть так:
#   «Х4/34-4»
# Предлагается упрощенный способ подсчета количества очков:
#   «Х» – strike всегда 20 очков
#   «4/» - spare всегда 15 очков
#   «34» – сумма 3+4=7
#   «-4» - сумма 0+4=4
# То есть для игры «Х4/34-4» сумма очков равна 20+15+7+4=46
#
# Надо написать python-модуль (назвать bowling), предоставляющий API расчета количества очков:
# функцию get_score, принимающую параметр game_result. Функция должна выбрасывать исключения,
# когда game_result содержит некорректные данные. Использовать стандартные исключения по максимуму,
# если не хватает - создать свои.
#
# Обязательно написать тесты на этот модуль. Расположить в папке tests.

# Из текущего файла сделать консольную утилиту для определения количества очков, с помощью пакета argparse
# Скрипт должен принимать параметр --result и печатать на консоль:
#   Количество очков для результатов ХХХ - УУУ.

import argparse
from bowling import get_score

parser = argparse.ArgumentParser()
parser.add_argument('--result', required=True, help='Строка с результатом игры', dest='game_result')
parser.add_argument('--international',
                    help='Использовать междунвродую систему подсчета очков', dest='international')
parser.add_argument('--international', action='store_true',
                             help='Использовать междунвродую систему подсчета очков', dest='international')
args = parser.parse_args()
try:
    print("Результат игры:", get_score(args.game_result))
    # если я не передам --international
except Exception as exc:
    print("Неверные входные данные")
    print(exc)


# Командная строка Для вызова с терминала (русский подсчкет очков)
# python 02_tournament.py --input tournament.txt --output tournament_result.txt

# Командная строка Для вызова с терминала (междунаорождный подсчкет очков)
# python 02_tournament.py --input tournament.txt --output tournament_result.txt --international

# Зачет
